app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @messages = @group.messages.includes(:user)
    respond_to do |format|
      format.html
      format.json { @new_message = @messages.where('id > ?', params[:id]) }
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @message = @group.messages.new(message_params)
    if @message.save
---
INSERT INTO `messages` (`content`, `group_id`, `user_id`, `created_at`, `updated_at`, `image`) VALUES ('Odit delectus dolorem quo pariatur dignissimos officia quo.', 20, 16, '2018-06-06 10:11:39', '2018-06-06 10:11:39', NULL)

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 20 LIMIT 1